LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Control.cpp
        stcMDNS_RRQuestion  questionRR;
        if ((bResult = _readRRQuestion(questionRR))) {
            // Define host replies, BUT only answer queries after probing is done
            u8HostOrServiceReplies =
            sendParameter.m_u8HostReplyMask = ((ProbingStatus_Done == m_HostProbeInformation.m_ProbingStatus)
                                                ? _replyMaskForHost(questionRR.m_Header, 0)
                                                : 0);
            DEBUG_EX_INFO(if (u8HostOrServiceReplies) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Host reply needed %u\n"), u8HostOrServiceReplies); });

            // Check tiebreak need for host domain
            if (ProbingStatus_InProgress == m_HostProbeInformation.m_ProbingStatus) {
                bool    bFullNameMatch = false;
                if ((_replyMaskForHost(questionRR.m_Header, &bFullNameMatch)) &&
                    (bFullNameMatch)) {
                    // We're in 'probing' state and someone is asking for our host domain: this might be
                    // a race-condition: Two host with the same domain names try simutanously to probe their domains
                    // See: RFC 6762, 8.2 (Tiebraking)
                    // However, we're using a max. reduced approach for tiebreaking here: The higher IP-address wins!
                    DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Possible race-condition for host domain detected while probing.\n")););
                    Serial.printf(F("[MDNSResponder] _parseQuery: Possible race-condition for host domain detected while probing.\n"));

                    m_HostProbeInformation.m_bTiebreakNeeded = true;
                }
            }

            // Define service replies
            for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {
                // Define service replies, BUT only answer queries after probing is done
                uint8_t u8ReplyMaskForQuestion = ((ProbingStatus_Done == pService->m_ProbeInformation.m_ProbingStatus)
                                                    ? _replyMaskForService(questionRR.m_Header, *pService, 0)
                                                    : 0);
                u8HostOrServiceReplies |= (pService->m_u8ReplyMask |= u8ReplyMaskForQuestion);
                DEBUG_EX_INFO(if (u8ReplyMaskForQuestion) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Service reply needed for (%s.%s.%s): %u (%s)\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol, u8ReplyMaskForQuestion, IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str()); } );
                /*if ((u8ReplyMaskForQuestion) &&
                    (0 == os_strcmp("hap", pService->m_pcService))) {
                    DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Service reply needed for (%s.%s.%s): %u (%s)\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol, u8ReplyMaskForQuestion, IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str());
                }*/

                // Check tiebreak need for service domain
                if (ProbingStatus_InProgress == pService->m_ProbeInformation.m_ProbingStatus) {
                    bool    bFullNameMatch = false;
                    if ((_replyMaskForService(questionRR.m_Header, *pService, &bFullNameMatch)) &&
                        (bFullNameMatch)) {
                        // We're in 'probing' state and someone is asking for this service domain: this might be
                        // a race-condition: Two services with the same domain names try simutanously to probe their domains
                        // See: RFC 6762, 8.2 (Tiebraking)
                        // However, we're using a max. reduced approach for tiebreaking here: The 'higher' SRV host wins!
                        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Possible race-condition for service domain %s.%s.%s detected while probing.\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol););
                        Serial.printf(F("[MDNSResponder] _parseQuery: Possible race-condition for service domain %s.%s.%s detected while probing.\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol);

                        pService->m_ProbeInformation.m_bTiebreakNeeded = true;
                    }
                }
            }

            // Handle unicast and legacy specialities
            // If only one question asks for unicast reply, the whole reply packet is send unicast
            if (((DNS_MQUERY_PORT != m_pUDPContext->getRemotePort()) ||     // Unicast (maybe legacy) query OR
                 (questionRR.m_bUnicast)) &&                                    // Expressivly unicast query
                (!sendParameter.m_bUnicast)) {

                sendParameter.m_bUnicast = true;
                sendParameter.m_bCacheFlush = false;
                DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Unicast response for %s!\n"), IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str()););
                
                if ((DNS_MQUERY_PORT != m_pUDPContext->getRemotePort()) &&  // Unicast (maybe legacy) query AND
                    (1 == p_MsgHeader.m_u16QDCount) &&                          // Only one question AND
                    ((sendParameter.m_u8HostReplyMask) ||                       //  Host replies OR
                     (u8HostOrServiceReplies))) {                               //  Host or service replies available
                    // We're a match for this legacy query, BUT
                    // make sure, that the query comes from a local host
                    ip_info IPInfo_Local;
                    ip_info IPInfo_Remote;
                    if (((IPInfo_Remote.ip.addr = m_pUDPContext->getRemoteAddress())) &&
                        (((wifi_get_ip_info(SOFTAP_IF, &IPInfo_Local)) &&
                          (ip_addr_netcmp(&IPInfo_Remote.ip, &IPInfo_Local.ip, &IPInfo_Local.netmask))) ||  // Remote IP in SOFTAP's subnet OR
                         ((wifi_get_ip_info(STATION_IF, &IPInfo_Local)) &&
                          (ip_addr_netcmp(&IPInfo_Remote.ip, &IPInfo_Local.ip, &IPInfo_Local.netmask))))) { // Remote IP in STATION's subnet

                        DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Legacy query from local host %s!\n"), IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str()););

                        sendParameter.m_u16ID = p_MsgHeader.m_u16ID;
                        sendParameter.m_bLegacyQuery = true;
                        sendParameter.m_pQuestions = new stcMDNS_RRQuestion;
                        if ((bResult = (0 != sendParameter.m_pQuestions))) {
                            sendParameter.m_pQuestions->m_Header.m_Domain = questionRR.m_Header.m_Domain;
                            sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Type = questionRR.m_Header.m_Attributes.m_u16Type;
                            sendParameter.m_pQuestions->m_Header.m_Attributes.m_u16Class = questionRR.m_Header.m_Attributes.m_u16Class;
                        }
                        else {
                            DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: FAILED to add legacy question!\n")););
                        }
                    }
                    else {
                        DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Legacy query from NON-LOCAL host!\n")););
                        bResult = false;
                    }
                }
            }
        }
        else {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: FAILED to read question!\n")););
        }
        esp_yield();
    }   // for questions

