LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Control.cpp
    //DEBUG_EX_INFO(if (u8HostOrServiceReplies) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Reply needed: %u (%s: %s->%s)\n"), u8HostOrServiceReplies, clsTimeSyncer::timestr(), IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str(), IPAddress(m_pUDPContext->getDestAddress()).toString().c_str()); } );

    // Handle known answers
    uint32_t    u32Answers = (p_MsgHeader.m_u16ANCount + p_MsgHeader.m_u16NSCount + p_MsgHeader.m_u16ARCount);
    DEBUG_EX_INFO(if ((u8HostOrServiceReplies) && (u32Answers)) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Known answers(%u):\n"), u32Answers); } );

    for (uint32_t an=0; ((bResult) && (an<u32Answers)); ++an) {
        stcMDNS_RRAnswer*   pKnownRRAnswer = 0;
        if (((bResult = _readRRAnswer(pKnownRRAnswer))) &&
            (pKnownRRAnswer)) {

            if ((DNS_RRTYPE_ANY != pKnownRRAnswer->m_Header.m_Attributes.m_u16Type) &&      // No ANY type answer
                (DNS_RRCLASS_ANY != pKnownRRAnswer->m_Header.m_Attributes.m_u16Class)) {    // No ANY class answer
                
                // Find match between planned answer (sendParameter.m_u8HostReplyMask) and this 'known answer'
                uint8_t u8HostMatchMask = (sendParameter.m_u8HostReplyMask & _replyMaskForHost(pKnownRRAnswer->m_Header));
                if ((u8HostMatchMask) &&                                            // The RR in the known answer matches an RR we are planning to send, AND
                    ((MDNS_HOST_TTL / 2) <= pKnownRRAnswer->m_u32TTL)) {            // The TTL of the known answer is longer than half of the new host TTL (120s)
                    
                    // Compare contents
                    if (AnswerType_PTR == pKnownRRAnswer->answerType()) {
                        stcMDNS_RRDomain    hostDomain;
                        if ((_buildDomainForHost(m_pcHostname, hostDomain)) &&
                            (((stcMDNS_RRAnswerPTR*)pKnownRRAnswer)->m_PTRDomain == hostDomain)) {
                            // Host domain match
#ifdef MDNS_IP4_SUPPORT
                            if (u8HostMatchMask & ContentFlag_PTR_IP4) {
                                // IP4 PTR was asked for, but is already known -> skipping
                                DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: IP4 PTR already known... skipping!\n")););
                                sendParameter.m_u8HostReplyMask &= ~ContentFlag_PTR_IP4;
                            }
#endif
#ifdef MDNS_IP6_SUPPORT
                            if (u8HostMatchMask & ContentFlag_PTR_IP6) {
                                // IP6 PTR was asked for, but is already known -> skipping
                                DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: IP6 PTR already known... skipping!\n")););
                                sendParameter.m_u8HostReplyMask &= ~ContentFlag_PTR_IP6;
                            }
#endif
                        }
                    }
                    else if (u8HostMatchMask & ContentFlag_A) {
                        // IP4 address was asked for
#ifdef MDNS_IP4_SUPPORT
                        if ((AnswerType_A == pKnownRRAnswer->answerType()) &&
                            (((stcMDNS_RRAnswerA*)pKnownRRAnswer)->m_IPAddress == _getResponseMulticastInterface(SOFTAP_MODE | STATION_MODE))) {

                            DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: IP4 address already known... skipping!\n")););
                            sendParameter.m_u8HostReplyMask &= ~ContentFlag_A;
                        }   // else: RData NOT IP4 length !!
#endif
                    }
                    else if (u8HostMatchMask & ContentFlag_AAAA) {
                        // IP6 address was asked for
#ifdef MDNS_IP6_SUPPORT
                        if ((AnswerType_AAAA == pAnswerRR->answerType()) &&
                            (((stcMDNS_RRAnswerAAAA*)pAnswerRR)->m_IPAddress == _getResponseMulticastInterface(SOFTAP_MODE | STATION_MODE))) {

                            DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: IP6 address already known... skipping!\n")););
                            sendParameter.m_u8HostReplyMask &= ~ContentFlag_AAAA;
                        }   // else: RData NOT IP6 length !!
#endif
                    }
                }   // Host match /*and TTL*/

                //
                // Check host tiebreak possibility
                if (m_HostProbeInformation.m_bTiebreakNeeded) {
                    stcMDNS_RRDomain    hostDomain;
                    if ((_buildDomainForHost(m_pcHostname, hostDomain)) &&
                        (pKnownRRAnswer->m_Header.m_Domain == hostDomain)) {
                        // Host domain match
#ifdef MDNS_IP4_SUPPORT
                        if (AnswerType_A == pKnownRRAnswer->answerType()) {
                            IPAddress   localIPAddress(_getResponseMulticastInterface(SOFTAP_MODE | STATION_MODE));
                            if (((stcMDNS_RRAnswerA*)pKnownRRAnswer)->m_IPAddress == localIPAddress) {
                                // SAME IP address -> We've received an old message from ourselfs (same IP)
                                DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Tiebreak (IP4) WON (was an old message)!\n")););
                                m_HostProbeInformation.m_bTiebreakNeeded = false;
                            }
                            else {
                                if (((stcMDNS_RRAnswerA*)pKnownRRAnswer)->m_IPAddress > localIPAddress) { // The OTHER IP is 'higher' -> LOST
                                    // LOST tiebreak
                                    DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Tiebreak (IP4) LOST (lower)!\n")););
                                    _cancelProbingForHost();
                                    m_HostProbeInformation.m_bTiebreakNeeded = false;
                                }
                                else {  // WON tiebreak
                                    //TiebreakState = TiebreakState_Won;    // We received an 'old' message from ourselfs -> Just ignore
                                    DEBUG_EX_RX(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Tiebreak (IP4) WON (higher IP)!\n")););
                                    m_HostProbeInformation.m_bTiebreakNeeded = false;
                                }
                            }
                        }
#endif
#ifdef MDNS_IP6_SUPPORT
                        if (AnswerType_AAAA == pAnswerRR->answerType()) {
                            // TODO
                        }
#endif
                    }
                }   // Host tiebreak possibility

                // Check service answers
                for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {

                    uint8_t u8ServiceMatchMask = (pService->m_u8ReplyMask & _replyMaskForService(pKnownRRAnswer->m_Header, *pService));

