LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Control.cpp
        if (pKnownRRAnswer) {
            delete pKnownRRAnswer;
            pKnownRRAnswer = 0;
        }
        esp_yield();
    }   // for answers

    if (bResult) {
        // Check, if a reply is needed
        uint8_t u8ReplyNeeded = sendParameter.m_u8HostReplyMask;
        for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {
            u8ReplyNeeded |= pService->m_u8ReplyMask;

            if ((u8ReplyNeeded) &&
                (0 == os_strcmp("hap", pService->m_pcService))) {
                DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Sending service reply for (%s.%s.%s): %u (%s)\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol, u8ReplyNeeded, IPAddress(m_pUDPContext->getRemoteAddress()).toString().c_str());
            }
        }

        if (u8ReplyNeeded) {
            DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Sending answer(%u)...\n"), u8ReplyNeeded););
            sendParameter.m_bResponse = true;
            sendParameter.m_bAuthorative = true;
            bResult = _sendMDNSMessage(sendParameter);
        }
        else {
            //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: No reply needed\n")););
        }
    }
    else {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: Something FAILED!\n")););
        m_pUDPContext->flush();
    }

    //
    // Check and reset tiebreak-states
    if (m_HostProbeInformation.m_bTiebreakNeeded) {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: UNSOLVED tiebreak-need for host domain!\n")););
        m_HostProbeInformation.m_bTiebreakNeeded = false;
    }
    for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {
        if (pService->m_ProbeInformation.m_bTiebreakNeeded) {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: UNSOLVED tiebreak-need for service domain (%s.%s.%s)\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol););
            pService->m_ProbeInformation.m_bTiebreakNeeded = false;
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseQuery: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_parseResponse
 *
 * Responses are of interest in two cases:
 * 1. find domain name conflicts while probing
 * 2. get answers to service queries
 *
 * In both cases any included questions are ignored
 *
 * 1. If any answer has a domain name similar to one of the domain names we're planning to use (and are probing for),
 *    then we've got a 'probing conflict'. The conflict has to be solved on our side of the conflict (eg. by
 *    setting a new hostname and restart probing). The callback 'm_fnProbeResultCallback' is called with
 *    'p_bProbeResult=false' in this case.
 *
 * 2. Service queries like '_http._tcp.local' will (if available) produce PTR, SRV, TXT and A/AAAA answers.
 *    All stored answers are pivoted by the service instance name (from the PTR record). Other answer parts,
 *    like host domain or IP address are than attached to this element.
 *    Any answer part carries a TTL, this is also stored (incl. the reception time); if the TTL is '0' the
 *    answer (part) is withdrawn by the sender and should be removed from any cache. RFC 6762, 10.1 proposes to
 *    set the caches TTL-value to 1 second in such a case and to delete the item only, if no update has
 *    has taken place in this second.
 *    Answer parts may arrive in 'unsorted' order, so they are grouped into three levels:
 *    Level 1: PRT - names the service instance (and is used as pivot), voids all other parts if is withdrawn or outdates
 *    Level 2: SRV - links the instance name to a host domain and port, voids A/AAAA parts if is withdrawn or outdates
 *             TXT - links the instance name to services TXTs
 *    Level 3: A/AAAA - links the host domain to an IP address
 */
bool MDNSResponder::_parseResponse(const MDNSResponder::stcMDNS_MsgHeader& p_MsgHeader) {
    //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse\n")););
    //DEBUG_EX_INFO(_udpDump(););
    
    bool    bResult = false;
    
    // A response should be the result of a query or a probe
    if ((_hasServiceQueriesWaitingForAnswers()) ||          // Waiting for query answers OR
        (_hasProbesWaitingForAnswers())) {                  // Probe responses

       DEBUG_EX_INFO(
                DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: Received a response\n"));
                //_udpDump();
        );

        bResult = true;
        //
        // Ignore questions here
        stcMDNS_RRQuestion  dummyRRQ;
        for (uint16_t qd=0; ((bResult) && (qd<p_MsgHeader.m_u16QDCount)); ++qd) {
            DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: Received a response containing a question... ignoring!\n")););
            bResult = _readRRQuestion(dummyRRQ);
            esp_yield();
        }   // for queries
        
        //
        // Read and collect answers
        stcMDNS_RRAnswer*   pCollectedRRAnswers = 0;
        uint32_t            u32NumberOfAnswerRRs = (p_MsgHeader.m_u16ANCount + p_MsgHeader.m_u16NSCount + p_MsgHeader.m_u16ARCount);
        for (uint32_t an=0; ((bResult) && (an<u32NumberOfAnswerRRs)); ++an) {
            stcMDNS_RRAnswer*   pRRAnswer = 0;
            if (((bResult = _readRRAnswer(pRRAnswer))) &&
                (pRRAnswer)) {
                //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: ADDING answer!\n")););
                pRRAnswer->m_pNext = pCollectedRRAnswers;
                pCollectedRRAnswers = pRRAnswer;
            }
            else {
                DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: FAILED to read answer!\n")););
                if (pRRAnswer) {
                    delete pRRAnswer;
                    pRRAnswer = 0;
                }
                bResult = false;
            }
            esp_yield();
        }   // for answers
        
        //
        // Process answers
        if (bResult) {
            bResult = ((!pCollectedRRAnswers) ||
                       (_processAnswers(pCollectedRRAnswers)));
        }
        else {  // Some failure while reading answers
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: FAILED to read answers!\n")););
            m_pUDPContext->flush();
        }
        
        // Delete collected answers
        while (pCollectedRRAnswers) {
            //DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: DELETING answer!\n")););
            stcMDNS_RRAnswer*   pNextAnswer = pCollectedRRAnswers->m_pNext;
            delete pCollectedRRAnswers;
            pCollectedRRAnswers = pNextAnswer;
        }
    }
    else {  // Received an unexpected response -> ignore
        /*DEBUG_EX_INFO(
                DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: Received an unexpected response... ignoring!\nDUMP:\n"));
                bool    bDumpResult = true;
                for (uint16_t qd=0; ((bDumpResult) && (qd<p_MsgHeader.m_u16QDCount)); ++qd) {
                    stcMDNS_RRQuestion  questionRR;
                    bDumpResult = _readRRQuestion(questionRR);
                    esp_yield();
                }   // for questions
                // Handle known answers
                uint32_t    u32Answers = (p_MsgHeader.m_u16ANCount + p_MsgHeader.m_u16NSCount + p_MsgHeader.m_u16ARCount);
                for (uint32_t an=0; ((bDumpResult) && (an<u32Answers)); ++an) {
                    stcMDNS_RRAnswer*   pRRAnswer = 0;
                    bDumpResult = _readRRAnswer(pRRAnswer);
                    if (pRRAnswer) {
                        delete pRRAnswer;
                        pRRAnswer = 0;
                    }
                    esp_yield();
                }
        );*/
        m_pUDPContext->flush();
        bResult = true;
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _parseResponse: FAILED!\n")); });
    return bResult;
}

