LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Control.cpp
/*
 * MDNSResponder::_processAnswers
 * Host:
 *  A (0x01):               eg. esp8266.local A OP TTL 123.456.789.012
 *  AAAA (01Cx):            eg. esp8266.local AAAA OP TTL 1234:5678::90
 *  PTR (0x0C, IP4):        eg. 012.789.456.123.in-addr.arpa PTR OP TTL esp8266.local
 *  PTR (0x0C, IP6):        eg. 90.0.0.0.0.0.0.0.0.0.0.0.78.56.34.12.ip6.arpa PTR OP TTL esp8266.local
 * Service:
 *  PTR (0x0C, srv name):   eg. _http._tcp.local PTR OP TTL MyESP._http._tcp.local
 *  PTR (0x0C, srv type):   eg. _services._dns-sd._udp.local PTR OP TTL _http._tcp.local
 *  SRV (0x21):             eg. MyESP._http._tcp.local SRV OP TTL PRIORITY WEIGHT PORT esp8266.local
 *  TXT (0x10):             eg. MyESP._http._tcp.local TXT OP TTL c#=1
 *
 */
bool MDNSResponder::_processAnswers(const MDNSResponder::stcMDNS_RRAnswer* p_pAnswers) {

    bool    bResult = false;
    
    if (p_pAnswers) {
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _processAnswers: Processing answers...\n")););
        bResult = true;
        
        // Answers may arrive in an unexpected order. So we loop our answers as long, as we
        // can connect new information to service queries
        bool    bFoundNewKeyAnswer;
        do {
            bFoundNewKeyAnswer = false;
            
            const stcMDNS_RRAnswer* pRRAnswer = p_pAnswers;
            while ((pRRAnswer) &&
                   (bResult)) {
                // 1. level answer (PTR)
                if (AnswerType_PTR == pRRAnswer->answerType()) {
                    // eg. _http._tcp.local PTR xxxx xx MyESP._http._tcp.local
                    bResult = _processPTRAnswer((stcMDNS_RRAnswerPTR*)pRRAnswer, bFoundNewKeyAnswer);   // May 'enable' new SRV or TXT answers to be linked to queries
                }
                // 2. level answers
                // SRV -> host domain and port
                else if (AnswerType_SRV == pRRAnswer->answerType()) {
                    // eg. MyESP_http._tcp.local SRV xxxx xx yy zz 5000 esp8266.local
                    bResult = _processSRVAnswer((stcMDNS_RRAnswerSRV*)pRRAnswer, bFoundNewKeyAnswer);   // May 'enable' new A/AAAA answers to be linked to queries
                }
                // TXT -> Txts
                else if (AnswerType_TXT == pRRAnswer->answerType()) {
                    // eg. MyESP_http._tcp.local TXT xxxx xx c#=1
                    bResult = _processTXTAnswer((stcMDNS_RRAnswerTXT*)pRRAnswer);
                }
                // 3. level answers
#ifdef MDNS_IP4_SUPPORT
                // A -> IP4Address
                else if (AnswerType_A == pRRAnswer->answerType()) {
                    // eg. esp8266.local A xxxx xx 192.168.2.120
                    bResult = _processAAnswer((stcMDNS_RRAnswerA*)pRRAnswer);
                }
#endif
#ifdef MDNS_IP6_SUPPORT
                // AAAA -> IP6Address
                else if (AnswerType_AAAA == pRRAnswer->answerType()) {
                    // eg. esp8266.local AAAA xxxx xx 09cf::0c
                    bResult = _processAAAAAnswer((stcMDNS_RRAnswerAAAA*)pRRAnswer);
                }
#endif

                // Finally check for probing conflicts
                // Host domain
                if ((ProbingStatus_InProgress == m_HostProbeInformation.m_ProbingStatus) &&
                    ((AnswerType_A == pRRAnswer->answerType()) ||
                     (AnswerType_AAAA == pRRAnswer->answerType()))) {

                    stcMDNS_RRDomain    hostDomain;
                    if ((_buildDomainForHost(m_pcHostname, hostDomain)) &&
                        (pRRAnswer->m_Header.m_Domain == hostDomain)) {

                        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _processAnswers: Probing CONFLICT found with: %s.local\n"), m_pcHostname););
                        _cancelProbingForHost();
                    }
                }
                // Service domains
                for (stcMDNSService* pService=m_pServices; pService; pService=pService->m_pNext) {
                    if ((ProbingStatus_InProgress == pService->m_ProbeInformation.m_ProbingStatus) &&
                        ((AnswerType_TXT == pRRAnswer->answerType()) ||
                         (AnswerType_SRV == pRRAnswer->answerType()))) {

                        stcMDNS_RRDomain    serviceDomain;
                        if ((_buildDomainForService(*pService, true, serviceDomain)) &&
                            (pRRAnswer->m_Header.m_Domain == serviceDomain)) {

                            DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _processAnswers: Probing CONFLICT found with: %s.%s.%s\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol););
                            _cancelProbingForService(*pService);
                        }
                    }
                }
                
                pRRAnswer = pRRAnswer->m_pNext; // Next collected answer
            }   // while (answers)
            esp_yield();
        } while ((bFoundNewKeyAnswer) &&
                 (bResult));
    }   // else: No answers provided
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _processAnswers: FAILED!\n")); });
    return bResult;
}

/*
 * MDNSResponder::_processPTRAnswer
 */
bool MDNSResponder::_processPTRAnswer(const MDNSResponder::stcMDNS_RRAnswerPTR* p_pPTRAnswer,
                                      bool& p_rbFoundNewKeyAnswer) {
    
    bool    bResult = false;
    
    if ((bResult = (0 != p_pPTRAnswer))) {
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _processPTRAnswer: Processing PTR answers...\n")););
        // eg. _http._tcp.local PTR xxxx xx MyESP._http._tcp.local
        // Check pending service queries for '_http._tcp'
        
        stcMDNSServiceQuery*    pServiceQuery = _findNextServiceQueryByServiceType(p_pPTRAnswer->m_Header.m_Domain, 0);
        while (pServiceQuery) {
            if (pServiceQuery->m_bAwaitingAnswers) {
                // Find answer for service domain (eg. MyESP._http._tcp.local)
                stcMDNSServiceQuery::stcAnswer* pSQAnswer = pServiceQuery->findAnswerForServiceDomain(p_pPTRAnswer->m_PTRDomain);
                if (pSQAnswer) {    // existing answer
                    if (p_pPTRAnswer->m_u32TTL) {   // Received update message
                        pSQAnswer->m_TTLServiceDomain.set(p_pPTRAnswer->m_u32TTL, millis());    // Update TTL tag
                        DEBUG_EX_INFO(
                                DEBUG_OUTPUT.printf(F("[MDNSResponder] _processPTRAnswer: Updated TTL for "));
                                _printRRDomain(pSQAnswer->m_ServiceDomain);
                                DEBUG_OUTPUT.printf(F("\n"));
                        );
                    }
                    else {                      // received goodbye-message
                        pSQAnswer->m_TTLServiceDomain.set(1, millis());             // See RFC 6762, 10.1
                        pSQAnswer->m_TTLServiceDomain.m_bUpdateScheduled = true;    // Avoid 'cache update' query
                        DEBUG_EX_INFO(
                                DEBUG_OUTPUT.printf(F("[MDNSResponder] _processPTRAnswer: 'Goodbye' received for "));
                                _printRRDomain(pSQAnswer->m_ServiceDomain);
                                DEBUG_OUTPUT.printf(F("\n"));
                        );
                    }
                }
                else if ((p_pPTRAnswer->m_u32TTL) &&                                // Not just a goodbye-message
                         ((pSQAnswer = new stcMDNSServiceQuery::stcAnswer))) {      // Not yet included -> add answer
                    pSQAnswer->m_ServiceDomain = p_pPTRAnswer->m_PTRDomain;
                    pSQAnswer->m_u32ContentFlags |= ServiceQueryAnswerType_ServiceDomain;
                    pSQAnswer->m_TTLServiceDomain.set(p_pPTRAnswer->m_u32TTL, millis());
                    pSQAnswer->releaseServiceDomain();
                    
                    bResult = pServiceQuery->addAnswer(pSQAnswer);
                    
                    p_rbFoundNewKeyAnswer = true;
                    if (pServiceQuery->m_fnCallback) {
                        pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer), ServiceQueryAnswerType_ServiceDomain, true, pServiceQuery->m_pUserdata);
                    }
                }
            }
            pServiceQuery = _findNextServiceQueryByServiceType(p_pPTRAnswer->m_Header.m_Domain, pServiceQuery);
        }
    }   // else: No p_pPTRAnswer
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _processPTRAnswer: FAILED!\n")); });
    return bResult;
}

