LaborEtArs/ESP8266mDNS/src/ESP8266mDNS-Control.cpp
                DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _announce: Announcing service %s.%s.%s (%u)\n"), (pService->m_pcName ?: m_pcHostname), pService->m_pcService, pService->m_pcProtocol, pService->m_u8ReplyMask););
            }
        }
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _announceService: FAILED!\n")); });
    return ((bResult) &&
            (_sendMDNSMessage(sendParameter)));
    //return bResult;
}

/*
 * MDNSResponder::_announceService
 */
bool MDNSResponder::_announceService(stcMDNSService& p_rService,
                                     bool p_bAnnounce /*= true*/) {

    bool    bResult = false;

    stcMDNSSendParameter    sendParameter;
    if (ProbingStatus_Done == p_rService.m_ProbeInformation.m_ProbingStatus) {

        sendParameter.m_bResponse = true;           // Announces are 'Unsolicited authorative responses'
        sendParameter.m_bAuthorative = true;
        sendParameter.m_bUnannounce = !p_bAnnounce; // When unannouncing, the TTL is set to '0' while creating the answers

        // DON'T announce host
        sendParameter.m_u8HostReplyMask = 0;

        // Announce services (service type, name, SRV (location) and TXTs)
        p_rService.m_u8ReplyMask = (ContentFlag_PTR_TYPE | ContentFlag_PTR_NAME | ContentFlag_SRV | ContentFlag_TXT);
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf(F("[MDNSResponder] _announceService: Announcing service %s.%s.%s (%u)\n"), (p_rService.m_pcName ?: m_pcHostname), p_rService.m_pcService, p_rService.m_pcProtocol, p_rService.m_u8ReplyMask););

        bResult = true;
    }
    DEBUG_EX_ERR(if (!bResult) { DEBUG_OUTPUT.printf(F("[MDNSResponder] _announceService: FAILED!\n")); });
    return ((bResult) &&
            (_sendMDNSMessage(sendParameter)));
}


/**
 * SERVICE QUERY CACHE
 */

/*
 * MDNSResponder::_hasServiceQueriesWaitingForAnswers
 */
bool MDNSResponder::_hasServiceQueriesWaitingForAnswers(void) const {
    
    bool    bOpenQueries = false;
    
    for (stcMDNSServiceQuery* pServiceQuery=m_pServiceQueries; pServiceQuery; pServiceQuery=pServiceQuery->m_pNext) {
        if (pServiceQuery->m_bAwaitingAnswers) {
            bOpenQueries = true;
            break;
        }
    }
    return bOpenQueries;
}
 
/*
 * MDNSResponder::_checkServiceQueryCache
 *
 * For any 'living' service query (m_bAwaitingAnswers == true) all available answers (their components)
 * are checked for topicality based on the stored reception time and the answers TTL.
 * When the components TTL is outlasted by more than 80%, a new question is generated, to get updated information.
 * When no update arrived (in time), the component is removed from the answer (cache).
 *
 */
bool MDNSResponder::_checkServiceQueryCache(void) {
    
    bool        bResult = true;
    
    uint32_t    u32Now = millis();
    for (stcMDNSServiceQuery* pServiceQuery=m_pServiceQueries; ((bResult) && (pServiceQuery)); pServiceQuery=pServiceQuery->m_pNext) {
        if (pServiceQuery->m_bAwaitingAnswers) {
            stcMDNSServiceQuery::stcAnswer* pSQAnswer = pServiceQuery->m_pAnswers;
            while ((bResult) &&
                   (pSQAnswer)) {
                stcMDNSServiceQuery::stcAnswer* pNextSQAnswer = pSQAnswer->m_pNext;
                
                // 1. level answer
                if ((bResult) &&
                    (pSQAnswer->m_TTLServiceDomain.has80Percent(u32Now))) {
                    
                    bResult = ((_sendMDNSServiceQuery(*pServiceQuery)) &&
                               ((pSQAnswer->m_TTLServiceDomain.m_bUpdateScheduled = true)));
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf(F("[MDNSResponder] _checkServiceQueryCache: Update scheduled for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf(F(" %s\n"), (bResult ? "OK" : "FAILURE"));
                    );
                }
                else if ((bResult) &&
                         (pSQAnswer->m_TTLServiceDomain.isOutdated(u32Now))) {
                    
                    // Delete
                    if (pServiceQuery->m_fnCallback) {
                        pServiceQuery->m_fnCallback(this, (hMDNSServiceQuery)pServiceQuery, pServiceQuery->indexOfAnswer(pSQAnswer)/*(uint32_t)(-1)*/, ServiceQueryAnswerType_ServiceDomain, false, pServiceQuery->m_pUserdata);
                    }
                    bResult = pServiceQuery->removeAnswer(pSQAnswer);
                    pSQAnswer = 0;
                    continue;   // Don't use this answer anymore
                }
                
                // 2. level answers
                // HostDomain & Port (from SRV)
                if ((bResult) &&
                    (pSQAnswer->m_TTLHostDomainAndPort.has80Percent(u32Now))) {
                    
                    bResult = ((_sendMDNSQuery(pSQAnswer->m_ServiceDomain, DNS_RRTYPE_SRV)) &&
                               ((pSQAnswer->m_TTLHostDomainAndPort.m_bUpdateScheduled = true)));
                    DEBUG_EX_INFO(
                            DEBUG_OUTPUT.printf(F("[MDNSResponder] _checkServiceQueryCache: Update scheduled for "));
                            _printRRDomain(pSQAnswer->m_ServiceDomain);
                            DEBUG_OUTPUT.printf(F(" host domain and port %s\n"), (bResult ? "OK" : "FAILURE"));
                    );
                }
                else if ((bResult) &&
                         (pSQAnswer->m_TTLHostDomainAndPort.isOutdated(u32Now))) {
                    
                    // Delete
                    pSQAnswer->m_HostDomain.clear();
                    pSQAnswer->releaseHostDomain();
                    pSQAnswer->m_u16Port = 0;
                    pSQAnswer->m_TTLHostDomainAndPort.set(0, 0);
                    uint32_t    u32ContentFlags = ServiceQueryAnswerType_HostDomainAndPort;
                    // As the host domain is the base for the IP4- and IP6Address, remove these too
#ifdef MDNS_IP4_SUPPORT
                    pSQAnswer->releaseIP4Addresses();
                    u32ContentFlags |= ServiceQueryAnswerType_IP4Address;
#endif
#ifdef MDNS_IP6_SUPPORT
                    pSQAnswer->releaseIP6Addresses();
                    u32ContentFlags |= ServiceQueryAnswerType_IP6Address;
#endif

                    // Remove content flags for deleted answer parts
                    pSQAnswer->m_u32ContentFlags &= ~u32ContentFlags;

